sex('Александр 3', 'M').
sex('Мария Федоровна', 'F').
sex('Николай 2', 'M').
sex('Александра Федоровна', 'F').
sex('Ольга Николаевна', 'F').
sex('Татьяна Николаевна', 'F').
sex('Мария Николаевна', 'F').
sex('Анастасия Николаевна', 'F').
sex('Алексей Николаевич', 'M').
sex('Александр Александрович', 'M').
sex('Георгий Александрович', 'M').
sex('Михаил Александрович', 'M').
sex('Ксения Александровна', 'F').
sex('Александр 2', 'M').
sex('Мария Александровна', 'F').
sex('Александра Александровна', 'F').
sex('Владимир Александрович', 'M').
sex('Мария Павловна', 'F').
sex('Кирилл Владимирович', 'M').
sex('Андрей Владимирович', 'M').
sex('Виктория Федоровна', 'F').
sex('Мария Кирилловна', 'F').
sex('Кира Кирилловна', 'F').
sex('Николай 1', 'M').
sex('Александра Федоровна', 'F').
sex('Константин Николаевич', 'M').
sex('Александра Иосифовна', 'F').
sex('Константин Константинович', 'M').
sex('Елизавета Маврикиевна', 'F').
sex('Олег Константинович', 'M').
sex('Игорь Константинович', 'M').
sex('Вера Константиновна', 'F').
parent('Александр 3', 'Николай 2').
parent('Александр 3', 'Георгий Александрович').
parent('Александр 3', 'Михаил Александрович').
parent('Александр 3', 'Ксения Александровна').
parent('Александр 3', 'Александр Александрович').
parent('Мария Федоровна', 'Николай 2').
parent('Мария Федоровна', 'Георгий Александрович').
parent('Мария Федоровна', 'Михаил Александрович').
parent('Мария Федоровна', 'Ксения Александровна').
parent('Мария Федоровна', 'Александр Александрович').
parent('Николай 2', 'Ольга Николаевна').
parent('Николай 2', 'Татьяна Николаевна').
parent('Николай 2', 'Мария Николаевна').
parent('Николай 2', 'Анастасия Николаевна').
parent('Николай 2', 'Алексей Николаевич').
parent('Александра Федоровна', 'Ольга Николаевна').
parent('Александра Федоровна', 'Татьяна Николаевна').
parent('Александра Федоровна', 'Мария Николаевна').
parent('Александра Федоровна', 'Анастасия Николаевна').
parent('Александра Федоровна', 'Алексей Николаевич').
parent('Александр 2', 'Владимир Александрович').
parent('Александр 2', 'Александр 3').
parent('Александр 2', 'Александра Александровна').
parent('Мария Александровна', 'Владимир Александрович').
parent('Мария Александровна', 'Александр 3').
parent('Мария Александровна', 'Александра Александровна').
parent('Владимир Александрович', 'Кирилл Владимирович').
parent('Владимир Александрович', 'Андрей Владимирович').
parent('Мария Павловна', 'Кирилл Владимирович').
parent('Мария Павловна', 'Андрей Владимирович').
parent('Кирилл Владимирович', 'Мария Кирилловна').
parent('Кирилл Владимирович', 'Кира Кирилловна').
parent('Виктория Федоровна', 'Мария Кирилловна').
parent('Виктория Федоровна', 'Кира Кирилловна').
parent('Николай 1', 'Александр 2').
parent('Николай 1', 'Константин Николаевич').
parent('Александра Федоровна', 'Александр 2').
parent('Александра Федоровна', 'Константин Николаевич').
parent('Константин Николаевич', 'Константин Константинович').
parent('Александра Иосифовна', 'Константин Константинович').
parent('Константин Константинович', 'Олег Константинович').
parent('Константин Константинович', 'Игорь Константинович').
parent('Константин Константинович', 'Вера Константиновна').
parent('Елизавета Маврикиевна', 'Олег Константинович').
parent('Елизавета Маврикиевна', 'Игорь Константинович').
parent('Елизавета Маврикиевна', 'Вера Константиновна').
